{"keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "SimpleRNN", "config": {"dtype": "float32", "bias_regularizer": null, "activation": "tanh", "go_backwards": false, "dropout": 0.0, "kernel_constraint": null, "unroll": true, "kernel_regularizer": null, "batch_input_shape": [null, 28, 28], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_dropout": 0.0, "stateful": false, "return_state": false, "units": 50, "use_bias": true, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "return_sequences": false, "recurrent_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "simple_rnn_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "activity_regularizer": null, "name": "dense_1", "units": 10}}]}